import PageNavigator from "components/PageNavigator";

export default function RulesPage() {
	return (
		<>
			<PageNavigator
				text="قوانین و مقررات"
				bottomText="قوانین و مقررات"
			/>

			<div
				className="border-[1.5px] border-gray-300 rounded-3xl flex flex-col gap-4 m-4 p-8 leading-8"
				dir="rtl"
			>
				<h1 className="flex justify-center font-semibold">
					مقررات فروشگاه اینترنتی سون شاپ
				</h1>
				<p className="text-red font-semibold">
					تایید و پرداخت فاكتور توسط خریدار به منزله تایید تمامی موارد
					در بخش مقررات سایت سون شاپ می‌باشد.
				</p>
				<ul className="list-disc mr-4">
					<li>
						سون شاپ موظف است کالایی مطابق با مشخصات فنی درج شده در
						سایت که خریدار آن را انتخاب کرده و سفارش داده است را
						برای او ارسال کند.
					</li>
					<li>
						سون شاپ موظف است مشخصات كالا از نظر گارانتی و رنگ را
						دقیقا مانند آنچه خریدار انتخاب کرده است را برای او ارسال
						نماید.
					</li>
					<li>
						در سون شاپ ، با توجه به نوسانات بازار، قیمت‌ها هر لحظه
						تغییر می‌کنند و پس از تایید سفارش از سوی سون شاپ ، به
						هیچ وجه امکان تغییر قیمت محصول (کاهش یا افزایش) در
						فاکتور وجود نخواهد داشت. پس از ثبت سفارش، به هیچ وجه
						امکان تغییر روش ارسال و آدرس حمل وجود نخواهد داشت.
					</li>
					<li>
						سون شاپ بنا به درخواست مشتری اجناس را به صورت آكبند بدون
						تست و یا در صورت درخواست مشتری باز شده و تست شده ارسال
						می‌نماید. در صورتیکه امکان ثبت درخواست تست وجود داشته
						باشد، گزینه‌ی آن در هنگام خرید به شما نمایش داده می‌شود
						تا انتخاب فرمایید. چنانچه این گزینه وجود نداشته باشد، به
						این معناست که حجم کاری واحد پردازش سفارش‌ها به صورتی است
						که کالاها فقط به صورت آکبند ارسال می‌شوند و امکان تست
						آنها وجود ندارد اما همیشه ضمانت هفت روزه سون شاپ برای
						تمام سفارش‌ها ارائه می‌شود.
					</li>
					<li>
						با توجه به اینکه شرکت‌های سازنده ممکن است یک مدل کالا را
						با مشخصه‌های مختلفی در بازار عرضه کنند (مانند تفاوت در
						مشخصات نرم افزاری، سخت افزاری و یا محتویات جعبه کالا)،
						چنانچه آن مشخصه در صفحه مشخصات کالا توسط سون شاپ قید
						نشده لازم است خریدار در زمان سفارش آن کالا در سبد خرید
						سوال خود را در مورد مشخصاتی که در نظر دارد، مطرح کند تا
						توسط واحد پشتیبانی سون شاپ کنترل شود و خریدار پس از
						دریافت پاسخ اقدام به پرداخت و خرید کالا نماید.
					</li>
					<li>
						قیمت تمامی كالاها در سایت مشخص است و هیچ هزینه‌ای بجز
						هزینه حمل (در مواقعی که سون شاپ ارسال رایگان ندارد) به
						آن اضافه نخواهد شد.
					</li>
					<li>
						تایید و پردازش سفارشات در روزهای کاری انجام می‌شود و
						پردازش سفارش‌ها در تعطیلات رسمی امکان‌پذیر نیست.
					</li>
					<li>
						در صورت پرداخت بوسیله كارت و یا واریز به حساب، باید
						شماره فیش بانكی و یا چهار رقم آخر کارت بانکی به همراه
						نام صاحب حساب و زمان دقیق پرداخت را در قسمت مربوطه ثبت
						نمایید، پس از ثبت مشخصات پرداخت، این مشخصات توسط سون شاپ
						كنترل شده و تایید پرداخت به اطلاع شما خواهد رسید. ضمنا
						مرحله تایید پرداخت برای پرداخت‌های کارت به کارت و یا
						واریز به حساب تنها در روزهای کاری ممکن می‌باشد.
					</li>
					<li>
						تایید و پرداخت فاكتور توسط شما به منزله تایید تمامی
						موارد در بخش مقررات سایت سون شاپ می‌باشد.
					</li>
					<li>
						مسئولیت تمامی كالاها در هنگام ارسال بر عهده‌ی شركت‌های
						حمل‌و‌نقل و یا بیمه‌كننده شركت حمل‌و‌نقل می‌باشد و تمامی
						کالاهای گران قیمت از قبیل موبایل، تبلت و لپ تاپ بیمه‌ی
						حمل می‌گردند. سون شاپ نیز پیگیر درخواست‌های مشتری از
						شرکت حمل‌کننده خواهد بود.
					</li>
					<li>
						در هنگام دریافت سفارش خریدار موظف به کنترل بسته‌بندی
						سفارش می‌باشد تا در صورتیکه نقصی در بسته و یا محتوای آن
						در اثر حمل پیش آمده باشد آن را در حضور مامور شرکت حمل و
						نقل به‌صورت رسمی صورت جلسه کرده و از دریافت کالا خودداری
						نماید و مراتب حداکثر ظرف 24 ساعت به سون شاپ اطلاع داده
						شود تا سون شاپ بتواند پیگیری‌های لازم را انجام دهد.
					</li>
					<li>
						خریدار موظف است فورا پس از دریافت سفارش آن را از نظر
						ظاهری بررسی نماید و در صورت داشتن هر نوع اشکال ظاهری،
						شرح اشکال را به سون شاپ اعلام نماید؛ در صورت تاخیر در
						اعلام مشکل ظاهری سون شاپ مسئولیتی در قبال آن نخواهد
						داشت.
					</li>
					<li>
						خریدار موظف است در هنگام دریافت سفارش کاملا آن را از نظر
						مشخصات کالا بررسی کرده تا در صورتیکه مشخصات کالا مغایرتی
						با مشخصات ثبت شده در سایت سون شاپ داشته باشد آن را به
						سون شاپ اعلام نماید، در صورت تاخیر در اعلام مغایرت
						مشخصات سون شاپ مسئولیتی در قبال آن نخواهد داشت.
					</li>
					<li>
						کالایی که دارای اشکال فنی می‌باشد (و در مفاد شرایط ضمانت
						هفت روزه‌ی سون شاپ قرار گرفته باشد) پس از برگشت به سون
						شاپ مورد بررسی قرار می‌گیرد و درصورت تایید اشکال فنی
						توسط کارشناسان سون شاپ، مبلغ پرداخت شده توسط خریدار ظرف
						یک روز کاری به حساب خریدار عودت داده می شود.
					</li>
					<li>
						در صورتیكه كالای خریداری شده دچار نقص فنی باشد و توسط
						افرادی غیر از كارشناسان سون شاپ بررسی و یا تعمیر شود،
						سون شاپ مسئولیت آن را بر عهده نخواهد گرفت.
					</li>
					<li>
						در صورتیكه به دلیل هرگونه كار نرم‌افزاری و یا تغییر
						شرایط محصول نقصی برای كالای خریداری شده به وجود آید سون
						شاپ از پس گرفتن آن كالا معذور است.
					</li>
					<li>
						چنانچه كالای خریداری شده دچار نقص فنی باشد (و در مفاد
						شرایط ضمانت هفت روزه‌ی سون شاپ قرار گرفته باشد) و خریدار
						ظرف 7 روز از زمان دریافت آن را به سون شاپ عودت دهد هزینه
						عودت آن بر عهده سون شاپ خواهد بود.
					</li>
					<li>
						در صورت انصراف از خرید در شرایطی که کالا کاملا پلمپ باشد
						و مورد استفاده قرار نگرفته باشد خریدار می‌تواند آن را تا
						یک روز کاری پس از دریافت کالا به آدرس سون شاپ عودت داده
						و وجه آن‌را پس از کسر هزینه ارسال دریافت نماید. ضمنا
						هزینه عودت کالا به سون شاپ در صورت انصراف خریدار از خرید
						بر عهده خریدار می‌باشد.
					</li>
					<li>
						در صورت وجود اشکال و یا انصراف خریدار برای عودت کالا
						خریدار موظف است کالا را همراه با همه لوازم به درستی
						بسته‌بندی کرده و آن را بیمه حمل نموده و به آدرس سون شاپ
						ارسال نماید؛ در صورت آسیب رسیدن به کالا در حین حمل در
						صورتیکه کالا بیمه نشده باشد و به درستی بسته بندی نشده
						باشد مسئولیت آن بر عهده خریدار است.
					</li>
					<li>
						امکان عودت وجه تنها به حسابی که از آن حساب کالا خریداری
						شده است وجود دارد و سون شاپ از واریز وجه به حساب شخص
						دیگر یا شماره حساب دیگر معذور است.
					</li>
					<li>
						در سون شاپ قیمت گوشی ها جهت تنظیم بازار در حداقل ممکن
						قرار دارد اما امکان خرید عمده گوشی موبایل از سون شاپ
						وجود ندارد. سفارشهایی که به صورت متعدد و تکراری در جهت
						خرید عمده گوشی موبایل ثبت شوند، لغو شده و وجه به حساب
						پرداخت کننده بازگردانده خواهد شد.
					</li>
					<li>
						در صورت لغو سفارش، سون شاپ 48 ساعت کاری مهلت دارد تا وجه
						را عودت دهد. وجه فقط به همان حسابی که پرداخت از آن انجام
						شده است، عودت داده می‌شود. ارائه شماره شبا از سوی کاربر
						برای عودت وجه الزامی است.
					</li>
				</ul>
			</div>
		</>
	);
}
